Revit 2026 API

# ConduitSizeIteratorHasCurrent Method

---

Identifies if the iterator has a current item.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasCurrent()
```
```vb
Public Function HasCurrent As Boolean
```
```cpp
public:
bool HasCurrent()
```
```fsharp
member HasCurrent : unit -> bool
```

#### Return Value

Boolean True if there is a current item.

There is no current item if the iterator has not started yet or has been done.

#### Reference

ConduitSizeIterator Class

Autodesk.Revit.DB.Electrical Namespace